{
  "users": [
    {
      "id": 23,
      "firstName": "Bob",
      "lastName": "Greatlance",
      "thumbnail": "https://images.generated.photos/-xGFYXL6ts6pLJa6UKFheSLpVvkmH6sSbmHL7WfYMos/rs:fit:256:256/czM6Ly9pY29uczgu/Z3Bob3Rvcy1wcm9k/LnBob3Rvcy92M18w/MDA2MDc1LmpwZw.jpg",
      "authenticated": false
    },
    {
      "id": 48,
      "firstName": "Jack",
      "lastName": "Dowager",
      "thumbnail": "https://images.generated.photos/S1STKILAq-VlqXK3Exeq78FZuY_oimmVFg96qBHE8N0/rs:fit:256:256/czM6Ly9pY29uczgu/Z3Bob3Rvcy1wcm9k/LnBob3Rvcy92M18w/NDA0NjE3LmpwZw.jpg",
      "authenticated": true
    }
  ],
  "messages": [
    {
      "id": 1,
      "from": "bob",
      "message": "Hey bro, how's things?",
      "date": "2020-04-07 10:03:23"
    },
    {
      "id": 2,
      "from": "bob",
      "message": "I was working in the garden and just thought of you!\n\nHope you're not too worried about everything that's going on right now.",
      "date": "2020-04-07 10:03:45"
    },
    {
      "id": 3,
      "from": "jack",
      "message": "Heeey! Long time! Thanks for your message, man!",
      "date": "2020-04-07 10:06:15"
    },
    {
      "id": 4,
      "from": "jack",
      "message": "I am doing quite alright, thanks. How about you?",
      "date": "2020-04-07 10:06:24"
    },
    {
      "id": 5,
      "from": "bob",
      "message": "Can't complain.\n\nI was watching this movie the other night that really reminded me of our first project working together.\nThere were these three 17-year-olds who had just heard of Python and decided to build the next great thing in social networking, so they spent about a week pulling off all-nighters and barely got anywhere :))\n\nI think you can imagine what happens next 🙃",
      "date": "2020-04-07 10:07:01"
    },
    {
      "id": 6,
      "from": "jack",
      "message": "😂😂😂 Did they end up driving to the seaside and sleeping in the sun until they got severe sunburn like we did?",
      "date": "2020-04-07 10:08:55"
    },
    {
      "id": 7,
      "from": "bob",
      "message": "Something not very far from that!",
      "date": "2020-04-07 10:03:45"
    },
    {
      "id": 1738249421033,
      "from": "jack",
      "message": "uisque vitae sapien enim. Maecenas ut purus bibendum nisl efficitur tempus quis vitae sapien. Cras metus augue, porttitor ut dictum et, ullamcorper at diam. Fusce ante lectus, rutrum eu dui ac, ultrices auctor leo. Nullam ullamcorper bibendum sem, at faucibus mauris sollicitudin eget. Suspendisse potenti. Curabitur sit amet sapien vitae neque dapibus pretium. Mauris sagittis et turpis id ornare. Aenean feugiat nisl ligula, eget gravida felis convallis a. Ut elementum risus eget lobortis malesuada. Fusce condimentum commodo tempor. Ut ullamcorper gravida erat. Pellentesque habitant morbi tristique senectus et netus et malesuada fames ac turpis egestas. Maecenas accumsan erat a lectus consequat, ut porta leo pretium.",
      "date": "2025-01-30T15:03:41.033Z"
    },
    {
      "id": 1738249438948,
      "from": "jack",
      "message": ". Maecenas ut purus bibendum nisl efficitur tempus quis vitae sapien. Cras metus augue, porttitor ut dictum et, ullamcorper at diam. Fusce ante lectus, rutrum eu dui ac, ultrices auctor leo. Nullam ullamcorper bibendum sem, at faucibus mauris sollicitudin eget. Suspendisse ",
      "date": "2025-01-30T15:03:58.948Z"
    }
  ]
}